---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SolidCurveIntersection Properties
SolidCurveIntersection Class See Also Send Feedback
---

The SolidCurveIntersection type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ResultType | The result type used to calculate the intersections. |
|  | SegmentCount | The number of segments in the results. |

# See Also

SolidCurveIntersection Class

Autodesk.Revit.DB Namespace